import TravelMap from "../Map";

export default class map extends TravelMap {
    constructor() {
        super();

        this.staticId = "shelter";

        this.icon = "🏕️";

        this.name = "지하 벙커";
        this.description = "꽤 안전한 지하 벙커이다. 비상식량 등이 있기에 식량 걱정은 생각 안 해도 될 것 같은데, 아마 가끔은 위로 나가 식량을 구해야 할지 모른다. 이곳을 나가면 좀비들이 들끓는 지상에서의 모험이 시작될 것이다. 꽤 위험하기에 함부로 나가면 안 된다."
        
        this.doors = [
            {
                mapId: "broken-city"
            }
        ];

        this.baiscPlayerData = {
            positions: {
                "init": [1, 5],
                "broken-city": [7, 3]
            },
            type: "important"
        };

        this.data = [
            ["🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔲"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔲"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔲"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","⬛","🔳"],
            ["🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳","🔳"]
        ];
    }
}