import TravelMap from "../Map";

export default class map extends TravelMap {
    constructor() {
        super();

        this.staticId = "store";

        this.icon = "🏬";

        this.name = "어둡고 비어있는 슈퍼 마켓";
        this.description = "좀비들이 가끔 보이기에 조심히 다녀야 한다. 관리하는 사람들이 없어서 그런지 전등도 깨져 있고, 진열대는 무너진 곳도 있다. 급하게 물건을 챙기려고 했는지 꽤 난장판 상태이다. 쓸만한 것들은 꽤 있을 것이기에 잘 뒤져봐야 한다.";

        this.baiscPlayerData = {
            positions: {
                "broken-city": [15, 5]
            },
            type: "basic"
        };

        this.doors = [
            {
                mapId: "broken-city"
            }
        ];

        this.interactionPositions = [
            {
                beforeTile: "❗",
                afterTile: "◽",

                position: [1, 2],
                finditem: true
            },
            {
                beforeTile: "❗",
                afterTile: "◽",

                position: [3, 4],
                finditem: true
            },
            {
                beforeTile: "❗",
                afterTile: "◽",

                position: [5, 1],
                finditem: true
            },
            {
                beforeTile: "❗",
                afterTile: "◽",

                position: [7, 5],
                finditem: true
            }
        ];

        this.data = [
            ["🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥", "🟥"],
            ["🟥", "◽", "⬛", "◽", "⬛", "◽", "⬛", "◽", "⬛", "⬛", "◽", "◽", "🟥"],
            ["🟥", "◽", "⬛", "◽", "⬛", "◽", "⬛", "◽", "⬛", "⬛", "⬛", "◽", "🟥"],
            ["🟥", "◽", "⬛", "◽", "⬛", "◽", "⬛", "◽", "⬛", "⬛", "⬛", "◽", "🟥"],
            ["🟥", "◽", "⬛", "◽", "⬛", "◽", "⬛", "◽", "⬛", "⬛", "⬛", "◽", "🟥"],
            ["🟥", "◽", "⬛", "◽", "⬛", "◽", "⬛", "◽", "⬛", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬜", "🖨️", "⬜", "⬜", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬜", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬜", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬛", "⬜", "⬛", "⬛", "⬛", "🟥"],
            ["🟥", "🟥", "🟥", "🟥", "🟥", "🔲", "🔲", "🔲", "🟥", "🟥", "🟥", "🟥", "🟥"]
        ];
    }
}